Tekla Open API Reference for Tekla Structures 2025
PickerInputWithinAView Class
 The PickerInputWithinAView class is the base class of PickerInput instances that represent a valid pick of point(s) or object(s) in a view.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.PickerInput
 Tekla.Structures.Drawing.PickerInputWithinAView
 Tekla.Structures.Drawing.PickerInputObject
 Tekla.Structures.Drawing.PickerInputPointsWithinAView
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public abstract class PickerInputWithinAView : PickerInput
Public MustInherit Class PickerInputWithinAView
	Inherits PickerInput
The PickerInputWithinAView type exposes the following members.
Properties
Name | Description
PickedView
 The view within which the pick occurred.
Top
Methods
Name | Description
IsEqual
 Compares the current object with an object of the same type.
 (Overrides PickerInput.IsEqual(Object).)
Top
See Also
Reference
Tekla.Structures.Drawing Namespace